9/data/attachments/a45b1ba69fcc5a76.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:username>
            <nif:friendToBeAdded>Joseph_positive_Friend_14015_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>